// neetTypeDescriptions.js 파일을 새로 만듭니다.

export const neetTypeDescriptions = {
  "내향형 니트": {
    title: "자유롭고 싶지만, 소속감도 느끼고 싶어!",
    subtitle: "내향형 니트",
    description: [
      "내향형 니트는 어느 정도의 루틴은 필요하지만, 자유도를 선호하며, 무엇보다 적당한 교류와 소속감을 느끼고 싶어 하는 유형입니다.",
      "사람들과 활발한 교류보다는 혼자만의 시간에서 안정감을 찾으며, 자기만의 속도와 방식으로 차분하게 일상의 미션을 수행하는 것을 좋아합니다.",
      "자기 주도성이 높으며, 규칙적인 루틴을 통해 작지만 꾸준한 성취감을 느끼려 합니다."
    ],
    description2: "내향형 니트에게는 어떤 부서가 나오게 될까요? 확인하러 가볼까요?",
    buttonLabel: "부서추천 가기",
  },
  "단념형 니트": {
    title: "당장은 구직의사가 없는",
    subtitle: "단념형 니트",
    description: [
      "단념형 니트는 나를 위해 휴식을 가지고 있는 유형입니다.",
      "취업이나 구직의 부담에서 벗어나 현재의 상태를 유지하는데 중점을 두며 스트레스 없이 여유롭게 시간을 선호하며, ",
      "목표 설정보다는 지금의 일상을 조용히 보내는 것에 안정감을 찾습니다.",
      "실패나 부담을 느끼고 싶지 않아 도전보다는 쉬는 것을 선택하지만, 일상 속 소소한 경험에서 오는 작은 즐거움을 찾기도 합니다."
    ],
    description2: "단념형 니트에게는 어떤 부서가 나오게 될까요? 확인하러 가볼까요?",
    buttonLabel: "부서추천 가기",
  },
  "수험형 니트": {
    title: "구직의사가 높지만 잦은 시험 탈락 등으로 자신감을 상실한",
    subtitle: "수험형 니트",
    description: [
      "수험형 니트는 자신감을 상실했거나, 사회적 실패 경험이 쌓여 심리적 장벽이 생긴 유형입니다.",
      "취업 및 관계 형성에 대한 의지가 있지만, 거듭된 좌절로 인해 스스로에 대한 부정적 시각이 강하고 점차 도전에 대해 두려움을 느끼고 있습니다.",
      "작은 성취감을 쌓으며 자존감을 회복하는 것이 중요하며, 자기 이해와 성장에 중점을 두는 상담 및 활동을 통해 긍정적인 피드백을 경험할 때 안정감을 느낍니다."
    ],
    description2: "수험형 니트에게는 어떤 부서가 나오게 될까요? 확인하러 가볼까요?",
    buttonLabel: "부서추천 가기",
  },
  "업무형 니트": {
    title: "구직의사가 높고 원하는 직업이 확고한",
    subtitle: "업무형 니트",
    description: [
      "업무형 니트는 사회적 관계를 중요하게 여기고 실질적인 커리어와 관련된 활동에 관심이 많은 유형입니다.",
      "네트워킹을 통해 실제 업무로 이어질 수 있는 기회를 찾고 싶어하며 특정 산업이나 직무에 대한 사람들과의 교류를 선호합니다.",
      "작은 성과를 통해 차츰 자신감을 쌓아가며 목표를 향해 나아가는 기회를 필요로 하며, 유사한 관심사를 가진 사람들과의 교류에서 동기부여를 얻습니다."
    ],
    description2: "업무형 니트에게는 어떤 부서가 나오게 될까요? 확인하러 가볼까요?",
    buttonLabel: "부서추천 가기",
  },
};
